marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
/**
*   @file           Reg_eSys_FTM.h
*   @version        1.0.1
*
*   @brief          AUTOSAR Mcl - FTM register and bitfield defines.
*   @details        FTM register and bitfield defines, used by driver that access the FTM resources.
*
*   @addtogroup     FTM_MODULE
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : eDMA
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_2_REV_0002_20180713
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2018 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_FTM_H
#define REG_ESYS_FTM_H

#ifdef __cplusplus
extern "C" {
#endif
/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely 
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
* @section [global]
* Violates MISRA 2004 Advisory Rule 19.7, Use of function like macro.
* This violation is due to function like macro defined for register operations.
* Function like macro are used to reduce code complexity.
*
* @section Reg_eSys_FTM_H_REF_1
* Violates MISRA 2004 Required Rule 19.15, Precautions shall be taken in order to prevent the
* contents of a header file being included twice
* This is not a violation since all header files are protected against multiple inclusions
*
* @section Reg_eSys_FTM_H_REF_2
* Violates MISRA 2004 Required Rule 8.12, Array size not defined
* This violation is  due to the fact that this file is shared by multiple drivers: GPT, PWM and ICU.
* The array size depends by the number of eTimer modules used by all drivers. The eTimer common component
* driver doesn't have yet its own plugin which could be used to generate the common parameters.
*
*/

/*===============================================================================================
*                                         INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
===============================================================================================*/

#include "Reg_eSys.h"

/*===============================================================================================
*                               SOURCE FILE VERSION INFORMATION
===============================================================================================*/
/**
* @{
* @file         Reg_eSys_Ftm.h
*/
#define REG_ESYS_FTM_VENDOR_ID                    43
#define REG_ESYS_FTM_MODULE_ID                    255

/* @violates @ref Reg_eSys_FTM_H_REF_1 Identifier clash. */
#define REG_ESYS_FTM_AR_RELEASE_MAJOR_VERSION     4
/* @violates @ref Reg_eSys_FTM_H_REF_1 Identifier clash. */
#define REG_ESYS_FTM_AR_RELEASE_MINOR_VERSION     2
/* @violates @ref Reg_eSys_FTM_H_REF_1 Identifier clash. */
#define REG_ESYS_FTM_AR_RELEASE_REVISION_VERSION  2
#define REG_ESYS_FTM_SW_MAJOR_VERSION             1
#define REG_ESYS_FTM_SW_MINOR_VERSION             0
#define REG_ESYS_FTM_SW_PATCH_VERSION             1
/**@}*/

/*===============================================================================================
*                                      FILE VERSION CHECKS
===============================================================================================*/
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    /* Check if Reg_eSys_Ftm.h file and Reg_eSys.h are of the same Autosar version */
    #if ((REG_ESYS_FTM_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_FTM_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION))
        #error "AutoSar Version Numbers of Reg_eSys_Ftm.h and Reg_eSys.h are different"
    #endif
#endif

/*===============================================================================================
*                                           CONSTANTS
===============================================================================================*/

/*===============================================================================================
*                                       DEFINES AND MACROS
===============================================================================================*/

/*==================================================================================================
*                                GLOBAL DEFINES & DECLARATIONS
==================================================================================================*/
#define MCL_START_SEC_CONST_32

/** @violates @ref Reg_eSys_FTM_H_REF_1 Repeated include file MemMap.h */
#include "Mcl_MemMap.h"

/**
* @brief FTM base address array declaration
* @violates @ref Reg_eSys_FTM_H_REF_2 Array size not defined
*/
extern CONST(uint32, MCL_CONST) FTM_BASE_ADDR32[];

#define MCL_STOP_SEC_CONST_32

/** @violates @ref Reg_eSys_FTM_H_REF_1 Repeated include file MemMap.h */
#include "Mcl_MemMap.h"
/*==================================================================================================
*                                      DEFINES AND MACROS
==================================================================================================*/
/**
* @brief IPV_FTM macro definition.
* @details Generic define for IPV_FTM.
*/
#define IPV_FTM_04_00_29_00  (0x04002900U)
#define IPV_FTM_05_00_04_00  (0x05000400U)

/**
* @brief FTM module decoding
*/

