marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_MODULE_INDEX_U8(ch)      ((uint8)(((ch) & FTM_MOD_MASK_U8) >> FTM_MOD_SHIFT))
/**
* @brief FTM channel decoding
*/
#define FTM_CHANNEL_INDEX_U8(ch)     ((uint8)(((ch) & FTM_CH_MASK_U8)  >> FTM_CH_SHIFT))


/**
* @{
* @brief FTM Module Registers - Channel specific registers.
*/
#define FTM_CSC_ADDR32(u8ModuleIdx, u8ChannelIdx) (FTM_BASE_ADDR32[(u8ModuleIdx)] + ((uint32)((uint32)(u8ChannelIdx)<<(3UL)) + 0xCUL))
#define FTM_CV_ADDR32(u8ModuleIdx, u8ChannelIdx)  (FTM_BASE_ADDR32[(u8ModuleIdx)] + ((uint32)((uint32)(u8ChannelIdx)<<(3UL)) + 0x10UL))


/**
* @{
* @brief FTM Module Registers - Configuration registers.
*/
#define FTM_SC_ADDR32(u8ModuleIdx)                                  (FTM_BASE_ADDR32[(u8ModuleIdx)])
#define FTM_CNT_ADDR32(u8ModuleIdx)                                 (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x4UL)
#define FTM_MOD_ADDR32(u8ModuleIdx)                                 (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x8UL)
#define FTM_CNTIN_ADDR32(u8ModuleIdx)                               (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x4CUL)
#define FTM_STATUS_ADDR32(u8ModuleIdx)                              (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x50UL)           
#define FTM_MODE_ADDR32(u8ModuleIdx)                                (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x54UL)     
#define FTM_SYNC_ADDR32(u8ModuleIdx)                                (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x58UL)
#define FTM_OUTINIT_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x5CUL)
#define FTM_OUTMASK_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x60UL)
#define FTM_COMBINE_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x64UL)
#define FTM_DEADTIME_ADDR32(u8ModuleIdx)                            (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x68UL)
#define FTM_EXTTRIG_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x6CUL)
#define FTM_POL_ADDR32(u8ModuleIdx)                                 (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x70UL)
#define FTM_FMS_ADDR32(u8ModuleIdx)                                 (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x74UL)
#define FTM_FILTER_ADDR32(u8ModuleIdx)                              (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x78UL)   
#define FTM_FLTCTRL_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x7CUL)
#define FTM_QDCTRL_ADDR32(u8ModuleIdx)                              (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x80UL)
#define FTM_CONF_ADDR32(u8ModuleIdx)                                (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x84UL)
#define FTM_FLTPOL_ADDR32(u8ModuleIdx)                              (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x88UL)
#define FTM_SYNCONF_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x8CUL)
#define FTM_INVCTRL_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x90UL)
#define FTM_SWOCTRL_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x94UL)
#define FTM_PWMLOAD_ADDR32(u8ModuleIdx)                             (FTM_BASE_ADDR32[(u8ModuleIdx)] + 0x98UL)

/** MASK and SHIFT values for each register field */
/**
@{
* @brief FTMx_SC - Status And Control Register - bitfield mask and shift defines.
*/


#ifdef IPV_FTM
    #if ((IPV_FTM == IPV_FTM_04_00_29_00) || (IPV_FTM == IPV_FTM_05_00_04_00))
        #define FTM_SC_TOF_MASK_U32                 ((uint32)(BIT9))
        #ifndef FTM_SC_TOF_SHIFT
        #define FTM_SC_TOF_SHIFT                    ((uint32)(9U))
        #endif


        #define FTM_SC_TOIE_MASK_U32                ((uint32)(BIT8))
        #ifndef FTM_SC_TOIE_SHIFT
        #define FTM_SC_TOIE_SHIFT                   ((uint32)(8U))
        #endif

        #define FTM_SC_RF_MASK_U32                 ((uint32)(BIT7))
        #ifndef FTM_SC_RF_SHIFT
        #define FTM_SC_RF_SHIFT                    ((uint32)(7U))
        #endif


        #define FTM_SC_RIE_MASK_U32                ((uint32)(BIT6))
        #ifndef FTM_SC_RIE_SHIFT
        #define FTM_SC_RIE_SHIFT                   ((uint32)(6U))
        #endif
    #else
        #define FTM_SC_TOF_MASK_U32                 ((uint32)(BIT7))
        #ifndef FTM_SC_TOF_SHIFT
        #define FTM_SC_TOF_SHIFT                    ((uint32)(7U))
        #endif


        #define FTM_SC_TOIE_MASK_U32                ((uint32)(BIT6))
        #ifndef FTM_SC_TOIE_SHIFT
        #define FTM_SC_TOIE_SHIFT                   ((uint32)(6U))
        #endif
    #endif
#else
    #define FTM_SC_TOF_MASK_U32                 ((uint32)(BIT7))
    #ifndef FTM_SC_TOF_SHIFT
    #define FTM_SC_TOF_SHIFT                    ((uint32)(7U))
    #endif


    #define FTM_SC_TOIE_MASK_U32                ((uint32)(BIT6))
    #ifndef FTM_SC_TOIE_SHIFT
    #define FTM_SC_TOIE_SHIFT                   ((uint32)(6U))
    #endif
#endif

#define FTM_SC_CPWMS_MASK_U32               ((uint32)(BIT5))
#ifndef FTM_SC_CPWMS_SHIFT
#define FTM_SC_CPWMS_SHIFT                  ((uint32)(5U))
#endif

#define FTM_SC_CLKS_MASK_U32                ((uint32)(BIT4|BIT3))
#ifndef FTM_SC_CLKS_SHIFT
#define FTM_SC_CLKS_SHIFT                   ((uint32)(3U))
#endif

#define FTM_SC_PS_MASK_U32                  ((uint32)(BIT2|BIT1|BIT0))

/**
* @{
* @brief FTMx_MOD - Modulo Register - bitfield mask and shift defines.
*/

#define FTM_MOD_MOD_MASK_U32                ((uint32)(0xFFFF))
#define FTM_MOD_MOD_MASK_SHIFT              ((uint32)(0U))
#define FTM_MOD_MOD_MAX_VALUE               ((uint32)(0xFFFF))
/**
* @{
* @brief FTMx_CnSC - Channel Status And Control Register - bitfield mask and shift defines.
*/
#ifdef IPV_FTM
    #if (IPV_FTM == IPV_FTM_05_00_04_00)
        #define FTM_CSC_CHOV_MASK_U32       ((uint32)(BIT10))
        #define FTM_CSC_CHOV_SHIFT          ((uint32)(10U))
        #define FTM_CSC_CHIS_MASK_U32       ((uint32)(BIT9))
        #define FTM_CSC_CHIS_SHIFT          ((uint32)(9U))
    #endif
#endif 

