marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_CSC_CHF_MASK_U32               ((uint32)(BIT7))
#define FTM_CSC_CHF_SHIFT                  ((uint32)(7U))

#define FTM_CSC_CHIE_MASK_U32              ((uint32)(BIT6))
#define FTM_CSC_CHIE_SHIFT                 ((uint32)(6U))

#define FTM_CSC_MSB_MASK_U32               ((uint32)(BIT5))
#define FTM_CSC_MSB_SHIFT                  ((uint32)(5U))

#define FTM_CSC_MSA_MASK_U32               ((uint32)(BIT4))
#define FTM_CSC_MSA_SHIFT                  ((uint32)(4U))

#define FTM_CSC_ELSB_MASK_U32              ((uint32)(BIT3))
#define FTM_CSC_ELSB_SHIFT                 ((uint32)(3U))

#define FTM_CSC_ELSA_MASK_U32              ((uint32)(BIT2))
#define FTM_CSC_ELSA_SHIFT                 ((uint32)(2U))

#define FTM_CSC_DMA_MASK_U32               ((uint32)(BIT0))
#define FTM_CSC_DMA_SHIFT                  ((uint32)(0U))


/**
@{
* @brief FTMx_CnV - Channel Value - bitfield mask and shift defines.
*/
#define FTM_CV_VAL_MASK_U32                  ((uint32)(0xFFFFU))


/**
@{
* @brief FTMx_CNT - Counter Value - bitfield mask and shift defines.
*/
   
#define FTM_CNT_COUNT_MASK_U32              ((uint32)(0xFFFFU))
/**
@{
* @brief FTMx_CNTIN - Counter Initial Value - bitfield mask and shift defines.
*/


#define FTM_CNTIN_INIT_MASK_U32             ((uint32)(0xFFFFU))  

/**
@{
* @brief FTMx_STATUS - Capture and Compare Status Register - bitfield mask and shift defines.
*/

#define FTM_STATUS_CH7F_MASK_U32            ((uint32)(BIT7))
#ifndef FTM_STATUS_CH7F_SHIFT
#define FTM_STATUS_CH7F_SHIFT               ((uint32)(7U))
#endif

#define FTM_STATUS_CH6F_MASK_U32            ((uint32)(BIT6))
#ifndef FTM_STATUS_CH6F_SHIFT
#define FTM_STATUS_CH6F_SHIFT               ((uint32)(6U))
#endif

#define FTM_STATUS_CH5F_MASK_U32            ((uint32)(BIT5))
#ifndef FTM_STATUS_CH5F_SHIFT
#define FTM_STATUS_CH5F_SHIFT               ((uint32)(5U))
#endif

#define FTM_STATUS_CH4F_MASK_U32            ((uint32)(BIT4))
#ifndef FTM_STATUS_CH4F_SHIFT
#define FTM_STATUS_CH4F_SHIFT               ((uint32)(4U))
#endif

#define FTM_STATUS_CH3F_MASK_U32            ((uint32)(BIT3))
#ifndef FTM_STATUS_CH3F_SHIFT
#define FTM_STATUS_CH3F_SHIFT               ((uint32)(3U))
#endif

#define FTM_STATUS_CH2F_MASK_U32            ((uint32)(BIT2))
#ifndef FTM_STATUS_CH2F_SHIFT
#define FTM_STATUS_CH2F_SHIFT               ((uint32)(2U))
#endif

#define FTM_STATUS_CH1F_MASK_U32            ((uint32)(BIT1))
#ifndef FTM_STATUS_CH1F_SHIFT
#define FTM_STATUS_CH1F_SHIFT               ((uint32)(1U))
#endif

#define FTM_STATUS_CH0F_MASK_U32            ((uint32)(BIT0))

/**
@{
* @brief FTMx_MODE - Features Mode Selection Register - bitfield mask and shift defines.
*/

#define FTM_MODE_FAULTIE_MASK_U32           ((uint32)(BIT7))   
#ifndef FTM_MODE_FAULTIE_SHIFT
#define FTM_MODE_FAULTIE_SHIFT              ((uint32)(7U))
#endif

#define FTM_MODE_FAULTM_MASK_U32            ((uint32)(BIT6|BIT5))
#ifndef FTM_MODE_FAULTM_SHIFT
#define FTM_MODE_FAULTM_SHIFT               ((uint32)(5U))
#endif

#define FTM_MODE_CAPTEST_MASK_U32           ((uint32)(BIT4))
#ifndef FTM_MODE_CAPTEST_SHIFT
#define FTM_MODE_CAPTEST_SHIFT              ((uint32)(4U))
#endif

#define FTM_MODE_PWMSYNC_MASK_U32           ((uint32)(BIT3))
#ifndef FTM_MODE_PWMSYNC_SHIFT
#define FTM_MODE_PWMSYNC_SHIFT              ((uint32)(3U))
#endif

#define FTM_MODE_WPDIS_MASK_U32             ((uint32)(BIT2))
#ifndef FTM_MODE_WPDIS_SHIFT
#define FTM_MODE_WPDIS_SHIFT                ((uint32)(2U))
#endif

#define FTM_MODE_INIT_MASK_U32              ((uint32)(BIT1))
#ifndef FTM_MODE_INIT_SHIFT
#define FTM_MODE_INIT_SHIFT                 ((uint32)(1U))
#endif

#define FTM_MODE_FTMEN_MASK_U32             ((uint32)(BIT0))

/**
@{
* @brief FTMx_SYNC - Synchronization Register - bitfield mask and shift defines.
*/

#define FTM_SYNC_SWSYNC_MASK_U32         ((uint32)(BIT7))
#ifndef FTM_SYNC_SWSYNC_SHIFT
#define FTM_SYNC_SWSYNC_SHIFT            ((uint32)(7U))
#endif

#define FTM_SYNC_TRIG2_MASK_U32          ((uint32)(BIT6))
#ifndef FTM_SYNC_TRIG2_SHIFT
#define FTM_SYNC_TRIG2_SHIFT             ((uint32)(6U))
#endif

#define FTM_SYNC_TRIG1_MASK_U32          ((uint32)(BIT5))
#ifndef FTM_SYNC_TRIG1_SHIFT
#define FTM_SYNC_TRIG1_SHIFT             ((uint32)(5U))
#endif

#define FTM_SYNC_TRIG0_MASK_U32          ((uint32)(BIT4))
#ifndef FTM_SYNC_TRIG0_SHIFT
#define FTM_SYNC_TRIG0_SHIFT             ((uint32)(4U))
#endif

#define FTM_SYNC_SYNCHOM_MASK_U32        ((uint32)(BIT3))
#ifndef FTM_SYNC_SYNCHOM_SHIFT
#define FTM_SYNC_SYNCHOM_SHIFT           ((uint32)(3U))
#endif

#define FTM_SYNC_REINIT_MASK_U32         ((uint32)(BIT2))
#ifndef FTM_SYNC_REINIT_SHIFT
#define FTM_SYNC_REINIT_SHIFT            ((uint32)(2U))
#endif

#define FTM_SYNC_CNTMAX_MASK_U32         ((uint32)(BIT1))
#ifndef FTM_SYNC_CNTMAX_SHIFT
#define FTM_SYNC_CNTMAX_SHIFT            ((uint32)(1U))
#endif

#define FTM_SYNC_CNTMIN_MASK_U32         ((uint32)(BIT0))

/**
@{
* @brief FTMx_OUTINIT - Initial State For Channels Output - bitfield mask and shift defines.
*/

#define FTM_OUTINIT_CH7OI_MASK_U32       ((uint32)(BIT7))
#ifndef FTM_OUTINIT_CH7OI_SHIFT
#define FTM_OUTINIT_CH7OI_SHIFT          ((uint32)(7U))
#endif

#define FTM_OUTINIT_CH6OI_MASK_U32       ((uint32)(BIT6))
#ifndef FTM_OUTINIT_CH6OI_SHIFT
#define FTM_OUTINIT_CH6OI_SHIFT          ((uint32)(6U))
#endif

#define FTM_OUTINIT_CH5OI_MASK_U32       ((uint32)(BIT5))
#ifndef FTM_OUTINIT_CH5OI_SHIFT
#define FTM_OUTINIT_CH5OI_SHIFT          ((uint32)(5U))
#endif

#define FTM_OUTINIT_CH4OI_MASK_U32       ((uint32)(BIT4))
#ifndef FTM_OUTINIT_CH4OI_SHIFT
#define FTM_OUTINIT_CH4OI_SHIFT          ((uint32)(4U))
#endif

#define FTM_OUTINIT_CH3OI_MASK_U32       ((uint32)(BIT3))
#ifndef FTM_OUTINIT_CH3OI_SHIFT
#define FTM_OUTINIT_CH3OI_SHIFT          ((uint32)(3U))
#endif

#define FTM_OUTINIT_CH2OI_MASK_U32       ((uint32)(BIT2))
#ifndef FTM_OUTINIT_CH2OI_SHIFT
#define FTM_OUTINIT_CH2OI_SHIFT          ((uint32)(2U))
#endif

#define FTM_OUTINIT_CH1OI_MASK_U32       ((uint32)(BIT1))
#ifndef FTM_OUTINIT_CH1OI_SHIFT
#define FTM_OUTINIT_CH1OI_SHIFT          ((uint32)(1U))
#endif

#define FTM_OUTINIT_CH0OI_MASK_U32       ((uint32)(BIT0))

/**
@{
* @brief FTMx_OUTMASK - Output Mask - bitfield mask and shift defines.
*/

#define FTM_OUTMASK_CH7OM_MASK_U32       ((uint32)(BIT7))
#ifndef FTM_OUTMASK_CH7OM_SHIFT
#define FTM_OUTMASK_CH7OM_SHIFT          ((uint32)(7U))
#endif

#define FTM_OUTMASK_CH6OM_MASK_U32       ((uint32)(BIT6))
#ifndef FTM_OUTMASK_CH6OM_SHIFT
#define FTM_OUTMASK_CH6OM_SHIFT          ((uint32)(6U))
#endif

#define FTM_OUTMASK_CH5OM_MASK_U32       ((uint32)(BIT5))
#ifndef FTM_OUTMASK_CH5OM_SHIFT
#define FTM_OUTMASK_CH5OM_SHIFT          ((uint32)(5U))
#endif

#define FTM_OUTMASK_CH4OM_MASK_U32       ((uint32)(BIT4))
#ifndef FTM_OUTMASK_CH4OM_SHIFT
#define FTM_OUTMASK_CH4OM_SHIFT          ((uint32)(4U))
#endif

