marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_OUTMASK_CH3OM_MASK_U32       ((uint32)(BIT3))
#ifndef FTM_OUTMASK_CH3OM_SHIFT
#define FTM_OUTMASK_CH3OM_SHIFT          ((uint32)(3U))
#endif

#define FTM_OUTMASK_CH2OM_MASK_U32       ((uint32)(BIT2))
#ifndef FTM_OUTMASK_CH2OM_SHIFT
#define FTM_OUTMASK_CH2OM_SHIFT          ((uint32)(2U))
#endif

#define FTM_OUTMASK_CH1OM_MASK_U32       ((uint32)(BIT1))
#ifndef FTM_OUTMASK_CH1OM_SHIFT
#define FTM_OUTMASK_CH1OM_SHIFT          ((uint32)(1U))
#endif

#define FTM_OUTMASK_CH0OM_MASK_U32       ((uint32)(BIT0))

/**
@{
* @brief FTMx_COMBINE - Function For Linked Channels - bitfield mask and shift defines.
*/
#define FTM_COMBINE_MCOMBINE3_MASK_U32   ((uint32)(BIT31))
#ifndef FTM_COMBINE_MCOMBINE3_SHIFT
#define FTM_COMBINE_MCOMBINE3_SHIFT      ((uint32)(31U))
#endif

#define FTM_COMBINE_FAULTEN3_MASK_U32    ((uint32)(BIT30))
#ifndef FTM_COMBINE_FAULTEN3_SHIFT
#define FTM_COMBINE_FAULTEN3_SHIFT       ((uint32)(30U))
#endif

#define FTM_COMBINE_SYNCEN3_MASK_U32     ((uint32)(BIT29))
#ifndef FTM_COMBINE_SYNCEN3_SHIFT
#define FTM_COMBINE_SYNCEN3_SHIFT        ((uint32)(29U))
#endif

#define FTM_COMBINE_DTEN3_MASK_U32       ((uint32)(BIT28))
#ifndef FTM_COMBINE_DTEN3_SHIFT
#define FTM_COMBINE_DTEN3_SHIFT          ((uint32)(28U))
#endif

#define FTM_COMBINE_DECAP3_MASK_U32      ((uint32)(BIT27))
#ifndef FTM_COMBINE_DECAP3_SHIFT
#define FTM_COMBINE_DECAP3_SHIFT         ((uint32)(27U))
#endif

#define FTM_COMBINE_DECAPEN3_MASK_U32    ((uint32)(BIT26))
#ifndef FTM_COMBINE_DECAPEN3_SHIFT
#define FTM_COMBINE_DECAPEN3_SHIFT       ((uint32)(26U))
#endif

#define FTM_COMBINE_COMP3_MASK_U32       ((uint32)(BIT25))
#ifndef FTM_COMBINE_COMP3_SHIFT
#define FTM_COMBINE_COMP3_SHIFT          ((uint32)(25U))
#endif

#define FTM_COMBINE_COMBINE3_MASK_U32    ((uint32)(BIT24))
#ifndef FTM_COMBINE_COMBINE3_SHIFT
#define FTM_COMBINE_COMBINE3_SHIFT       ((uint32)(24U))
#endif


#define FTM_COMBINE_MCOMBINE2_MASK_U32    ((uint32)(BIT23))
#ifndef FTM_COMBINE_MCOMBINE2_SHIFT
#define FTM_COMBINE_MCOMBINE2_SHIFT       ((uint32)(23))
#endif

#define FTM_COMBINE_FAULTEN2_MASK_U32    ((uint32)(BIT22))
#ifndef FTM_COMBINE_FAULTEN2_SHIFT
#define FTM_COMBINE_FAULTEN2_SHIFT       ((uint32)(22U))
#endif

#define FTM_COMBINE_SYNCEN2_MASK_U32     ((uint32)(BIT21))
#ifndef FTM_COMBINE_SYNCEN2_SHIFT
#define FTM_COMBINE_SYNCEN2_SHIFT        ((uint32)(21U))
#endif

#define FTM_COMBINE_DTEN2_MASK_U32       ((uint32)(BIT20))
#ifndef FTM_COMBINE_DTEN2_SHIFT
#define FTM_COMBINE_DTEN2_SHIFT          ((uint32)(20U))
#endif

#define FTM_COMBINE_DECAP2_MASK_U32      ((uint32)(BIT19))
#ifndef FTM_COMBINE_DECAP2_SHIFT
#define FTM_COMBINE_DECAP2_SHIFT         ((uint32)(19U))
#endif

#define FTM_COMBINE_DECAPEN2_MASK_U32    ((uint32)(BIT18))
#ifndef FTM_COMBINE_DECAPEN2_SHIFT
#define FTM_COMBINE_DECAPEN2_SHIFT       ((uint32)(18U))
#endif

#define FTM_COMBINE_COMP2_MASK_U32       ((uint32)(BIT17))
#ifndef FTM_COMBINE_COMP2_SHIFT
#define FTM_COMBINE_COMP2_SHIFT          ((uint32)(17U))
#endif

#define FTM_COMBINE_COMBINE2_MASK_U32    ((uint32)(BIT16))
#ifndef FTM_COMBINE_COMBINE2_SHIFT
#define FTM_COMBINE_COMBINE2_SHIFT       ((uint32)(16U))
#endif


#define FTM_COMBINE_MCOMBINE1_MASK_U32    ((uint32)(BIT15))
#ifndef FTM_COMBINE_MCOMBINE1_SHIFT
#define FTM_COMBINE_MCOMBINE1_SHIFT       ((uint32)(15))
#endif

#define FTM_COMBINE_FAULTEN1_MASK_U32    ((uint32)(BIT14))
#ifndef FTM_COMBINE_FAULTEN1_SHIFT
#define FTM_COMBINE_FAULTEN1_SHIFT       ((uint32)(14U))
#endif

#define FTM_COMBINE_SYNCEN1_MASK_U32     ((uint32)(BIT13))
#ifndef FTM_COMBINE_SYNCEN1_SHIFT
#define FTM_COMBINE_SYNCEN1_SHIFT        ((uint32)(13U))
#endif

#define FTM_COMBINE_DTEN1_MASK_U32       ((uint32)(BIT12))
#ifndef FTM_COMBINE_DTEN1_SHIFT
#define FTM_COMBINE_DTEN1_SHIFT          ((uint32)(12U))
#endif

#define FTM_COMBINE_DECAP1_MASK_U32      ((uint32)(BIT11))
#ifndef FTM_COMBINE_DECAP1_SHIFT
#define FTM_COMBINE_DECAP1_SHIFT         ((uint32)(11U))
#endif

#define FTM_COMBINE_DECAPEN1_MASK_U32    ((uint32)(BIT10))
#ifndef FTM_COMBINE_DECAPEN1_SHIFT
#define FTM_COMBINE_DECAPEN1_SHIFT       ((uint32)(10U))
#endif

#define FTM_COMBINE_COMP1_MASK_U32       ((uint32)(BIT9))
#ifndef FTM_COMBINE_COMP1_SHIFT
#define FTM_COMBINE_COMP1_SHIFT          ((uint32)(9U))
#endif

#define FTM_COMBINE_COMBINE1_MASK_U32    ((uint32)(BIT8))
#ifndef FTM_COMBINE_COMBINE1_SHIFT
#define FTM_COMBINE_COMBINE1_SHIFT       ((uint32)(8U))
#endif


#define FTM_COMBINE_MCOMBINE0_MASK_U32    ((uint32)(BIT7))
#ifndef FTM_COMBINE_MCOMBINE0_SHIFT
#define FTM_COMBINE_MCOMBINE0_SHIFT       ((uint32)(7))
#endif

#define FTM_COMBINE_FAULTEN0_MASK_U32    ((uint32)(BIT6))
#ifndef FTM_COMBINE_FAULTEN0_SHIFT
#define FTM_COMBINE_FAULTEN0_SHIFT       ((uint32)(6U))
#endif

#define FTM_COMBINE_SYNCEN0_MASK_U32     ((uint32)(BIT5))
#ifndef FTM_COMBINE_SYNCEN0_SHIFT
#define FTM_COMBINE_SYNCEN0_SHIFT        ((uint32)(5U))
#endif

#define FTM_COMBINE_DTEN0_MASK_U32       ((uint32)(BIT4))
#ifndef FTM_COMBINE_DTEN0_SHIFT
#define FTM_COMBINE_DTEN0_SHIFT          ((uint32)(4U))
#endif

#define FTM_COMBINE_DECAP0_MASK_U32      ((uint32)(BIT3))
#ifndef FTM_COMBINE_DECAP0_SHIFT
#define FTM_COMBINE_DECAP0_SHIFT         ((uint32)(3U))
#endif

#define FTM_COMBINE_DECAPEN0_MASK_U32    ((uint32)(BIT2))
#ifndef FTM_COMBINE_DECAPEN0_SHIFT
#define FTM_COMBINE_DECAPEN0_SHIFT       ((uint32)(2U))
#endif

#define FTM_COMBINE_COMP0_MASK_U32       ((uint32)(BIT1))
#ifndef FTM_COMBINE_COMP0_SHIFT
#define FTM_COMBINE_COMP0_SHIFT          ((uint32)(1U))
#endif

#define FTM_COMBINE_COMBINE0_MASK_U32    ((uint32)(BIT0))
#ifndef FTM_COMBINE_COMBINE0_SHIFT
#define FTM_COMBINE_COMBINE0_SHIFT       ((uint32)(0U))
#endif

#define FTM_COMBINE_COMBINEx_SHIFT(u8ChannelIdx)        ((uint32)((((u8ChannelIdx) >> 1U) * 8U) + 0U))
#define FTM_COMBINE_COMBINEx_MASK_U32(u8ChannelIdx)     ((uint32)(BIT0 << FTM_COMBINE_COMBINEx_SHIFT(u8ChannelIdx)))

#define FTM_COMBINE_DECAPx_SHIFT(u8ChannelIdx)          ((uint32)((((u8ChannelIdx) >> 1U) * 8U) + 3U))
#define FTM_COMBINE_DECAPx_MASK_U32(u8ChannelIdx)       ((uint32)(BIT0 << FTM_COMBINE_DECAPx_SHIFT(u8ChannelIdx)))

#define FTM_COMBINE_DECAPENx_SHIFT(u8ChannelIdx)         ((uint32)((((u8ChannelIdx) >> 1U) * 8U)+ 2U))
#define FTM_COMBINE_DECAPENx_MASK_U32(u8ChannelIdx)      ((uint32)(BIT0 << FTM_COMBINE_DECAPENx_SHIFT(u8ChannelIdx)))

/**
@{
* @brief FTMx_DEADTIME - Deadtime Insertion Control - bitfield mask and shift defines.
*/

#ifdef IPV_FTM
    #if (IPV_FTM == IPV_FTM_05_00_04_00)
        #define FTM_DEADTIME_DTVALEX_MASK_U32  ((uint32)(BIT19|BIT18|BIT17|BIT16))
        #ifndef FTM_DEADTIME_DTVALEX_SHIFT
        #define FTM_DEADTIME_DTVALEX_SHIFT     ((uint32)(16U))
        #endif
    #endif
#endif

#define FTM_DEADTIME_DTPS_MASK_U32      ((uint32)(BIT7|BIT6))
#ifndef FTM_DEADTIME_DTPS_SHIFT
#define FTM_DEADTIME_DTPS_SHIFT         ((uint32)(6U))
#endif

#define FTM_DEADTIME_DTVAL_MASK_U32     ((uint32)(BIT5|BIT4|BIT3|BIT2|BIT1|BIT0))

/**
@{
* @brief FTMx_EXTTRIG - FTM External Trigger - bitfield mask and shift defines.
*/
#define FTM_EXTTRIG_CH7TRIG_MASK_U32          ((uint32)(BIT9))
#ifndef FTM_EXTTRIG_CH7TRIG_SHIFT
#define FTM_EXTTRIG_CH7TRIG_SHIFT             ((uint32)(9U))
#endif

#define FTM_EXTTRIG_CH6TRIG_MASK_U32          ((uint32)(BIT8))
#ifndef FTM_EXTTRIG_CH6TRIG_SHIFT
#define FTM_EXTTRIG_CH6TRIG_SHIFT             ((uint32)(8U))
#endif

#define FTM_EXTTRIG_TRIGF_MASK_U32            ((uint32)(BIT7))
#ifndef FTM_EXTTRIG_TRIGF_SHIFT
#define FTM_EXTTRIG_TRIGF_SHIFT               ((uint32)(7U))
#endif

#define FTM_EXTTRIG_INITTRIGEN_MASK_U32       ((uint32)(BIT6))
#ifndef FTM_EXTTRIG_INITTRIGEN_SHIFT
#define FTM_EXTTRIG_INITTRIGEN_SHIFT          ((uint32)(6U))
#endif

#define FTM_EXTTRIG_CH1TRIG_MASK_U32          ((uint32)(BIT5))
#ifndef FTM_EXTTRIG_CH1TRIG_SHIFT
#define FTM_EXTTRIG_CH1TRIG_SHIFT             ((uint32)(5U))
#endif

#define FTM_EXTTRIG_CH0TRIG_MASK_U32          ((uint32)(BIT4))
#ifndef FTM_EXTTRIG_CH0TRIG_SHIFT
#define FTM_EXTTRIG_CH0TRIG_SHIFT             ((uint32)(4U))
#endif

