marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_EXTTRIG_CH5TRIG_MASK_U32          ((uint32)(BIT3))
#ifndef FTM_EXTTRIG_CH5TRIG_SHIFT
#define FTM_EXTTRIG_CH5TRIG_SHIFT             ((uint32)(3U))
#endif

#define FTM_EXTTRIG_CH4TRIG_MASK_U32          ((uint32)(BIT2))
#ifndef FTM_EXTTRIG_CH4TRIG_SHIFT
#define FTM_EXTTRIG_CH4TRIG_SHIFT             ((uint32)(2U))
#endif

#define FTM_EXTTRIG_CH3TRIG_MASK_U32          ((uint32)(BIT1))
#ifndef FTM_EXTTRIG_CH3TRIG_SHIFT
#define FTM_EXTTRIG_CH3TRIG_SHIFT             ((uint32)(1U))
#endif

#define FTM_EXTTRIG_CH2TRIG_MASK_U32          ((uint32)(BIT0))

/**
@{
* @brief FTMx_POL - Channels Polarity - bitfield mask and shift defines.
*/

#define FTM_POL_POL7_MASK_U32               ((uint32)(BIT7))
#ifndef FTM_POL_POL7_SHIFT
#define FTM_POL_POL7_SHIFT                  ((uint32)(7U))
#endif

#define FTM_POL_POL6_MASK_U32               ((uint32)(BIT6))
#ifndef FTM_POL_POL6_SHIFT
#define FTM_POL_POL6_SHIFT                  ((uint32)(6U))
#endif

#define FTM_POL_POL5_MASK_U32               ((uint32)(BIT5))
#ifndef FTM_POL_POL5_SHIFT
#define FTM_POL_POL5_SHIFT                  ((uint32)(5U))
#endif

#define FTM_POL_POL4_MASK_U32               ((uint32)(BIT4))
#ifndef FTM_POL_POL4_SHIFT
#define FTM_POL_POL4_SHIFT                  ((uint32)(4U))
#endif

#define FTM_POL_POL3_MASK_U32               ((uint32)(BIT3))
#ifndef FTM_POL_POL3_SHIFT
#define FTM_POL_POL3_SHIFT                  ((uint32)(3U))
#endif

#define FTM_POL_POL2_MASK_U32               ((uint32)(BIT2))
#ifndef FTM_POL_POL2_SHIFT
#define FTM_POL_POL2_SHIFT                  ((uint32)(2U))
#endif

#define FTM_POL_POL1_MASK_U32               ((uint32)(BIT1))
#ifndef FTM_POL_POL1_SHIFT
#define FTM_POL_POL1_SHIFT                  ((uint32)(1U))
#endif

#define FTM_POL_POL0_MASK_U32               ((uint32)(BIT0))

/**
@{
* @brief FTMx_FMS - Fault Mode Status - bitfield mask and shift defines.
*/

#define FTM_FMS_FAULTF_MASK_U32              ((uint32)(BIT7))
#ifndef FTM_FMS_FAULTF_SHIFT
#define FTM_FMS_FAULTF_SHIFT                 ((uint32)(7U))
#endif

#define FTM_FMS_WPEN_MASK_U32                ((uint32)(BIT6))
#ifndef FTM_FMS_WPEN_SHIFT
#define FTM_FMS_WPEN_SHIFT                   ((uint32)(6U))
#endif

#define FTM_FMS_FAULTIN_MASK_U32             ((uint32)(BIT5))
#ifndef FTM_FMS_FAULTIN_SHIFT
#define FTM_FMS_FAULTIN_SHIFT                ((uint32)(5U))
#endif

#define FTM_FMS_FAULTF3_MASK_U32             ((uint32)(BIT3))
#ifndef FTM_FMS_FAULTF3_SHIFT
#define FTM_FMS_FAULTF3_SHIFT                ((uint32)(3U))
#endif

#define FTM_FMS_FAULTF2_MASK_U32             ((uint32)(BIT2))
#ifndef FTM_FMS_FAULTF2_SHIFT
#define FTM_FMS_FAULTF2_SHIFT                ((uint32)(2U))
#endif

#define FTM_FMS_FAULTF1_MASK_U32             ((uint32)(BIT1))
#ifndef FTM_FMS_FAULTF1_SHIFT
#define FTM_FMS_FAULTF1_SHIFT                ((uint32)(1U))
#endif

#define FTM_FMS_FAULTF0_MASK_U32             ((uint32)(BIT0))

/**
@{
* @brief FTMx_FILTER - Input Capture Filter Control - bitfield mask and shift defines.
*/

#define FTM_FILTER_CH3FVAL_MASK_U32                 ((uint32)(BIT15|BIT14|BIT13|BIT12))
#ifndef FTM_FILTER_CH3FVAL_SHIFT
#define FTM_FILTER_CH3FVAL_SHIFT                    ((uint32)(12U))
#endif

#define FTM_FILTER_CH2FVAL_MASK_U32                 ((uint32)(BIT11|BIT10|BIT9|BIT8))
#ifndef FTM_FILTER_CH2FVAL_SHIFT
#define FTM_FILTER_CH2FVAL_SHIFT                    ((uint32)(8U))
#endif

#define FTM_FILTER_CH1FVAL_MASK_U32                 ((uint32)(BIT7|BIT6|BIT5|BIT4))
#ifndef FTM_FILTER_CH1FVAL_SHIFT
#define FTM_FILTER_CH1FVAL_SHIFT                    ((uint32)(4U))
#endif

#define FTM_FILTER_CH0FVAL_MASK_U32                 ((uint32)(BIT3|BIT2|BIT1|BIT0))
#ifndef FTM_FILTER_CH0FVAL_SHIFT
#define FTM_FILTER_CH0FVAL_SHIFT                    ((uint32)(0U))
#endif

#define FTM_FILTER_CHxFVAL_SHIFT(u8ChannelIdx)      ((uint32)((u8ChannelIdx) << 2UL))
#define FTM_FILTER_CHxFVAL_MASK_U32(u8ChannelIdx)   (FTM_FILTER_CH0FVAL_MASK_U32 << \
                                                    FTM_FILTER_CHxFVAL_SHIFT(u8ChannelIdx))

#define FTM_FILTER_MAX_NO_CH                        ((uint8)(4U))
/**
@{
* @brief FTMx_FLTCTRL - Fault Control - bitfield mask and shift defines.
*/

#define FTM_FLTCTRL_FSTATE_MASK_U32          ((uint32)(BIT15))
#ifndef FTM_FLTCTRL_FSTATE_SHIFT       
#define FTM_FLTCTRL_FSTATE_SHIFT             ((uint32)(15U))
#endif

#define FTM_FLTCTRL_FFVAL_MASK_U32           ((uint32)(BIT11|BIT10|BIT9|BIT8))
#ifndef FTM_FLTCTRL_FFVAL_SHIFT
#define FTM_FLTCTRL_FFVAL_SHIFT              ((uint32)(8U))
#endif

#define FTM_FLTCTRL_FFLTR3EN_MASK_U32        ((uint32)(BIT7))
#ifndef FTM_FLTCTRL_FFLTR3EN_SHIFT
#define FTM_FLTCTRL_FFLTR3EN_SHIFT           ((uint32)(7U))
#endif

#define FTM_FLTCTRL_FFLTR2EN_MASK_U32        ((uint32)(BIT6))
#ifndef FTM_FLTCTRL_FFLTR2EN_SHIFT
#define FTM_FLTCTRL_FFLTR2EN_SHIFT           ((uint32)(6U))
#endif

#define FTM_FLTCTRL_FFLTR1EN_MASK_U32        ((uint32)(BIT5))
#ifndef FTM_FLTCTRL_FFLTR1EN_SHIFT
#define FTM_FLTCTRL_FFLTR1EN_SHIFT           ((uint32)(5U))
#endif

#define FTM_FLTCTRL_FFLTR0EN_MASK_U32        ((uint32)(BIT4))
#ifndef FTM_FLTCTRL_FFLTR0EN_SHIFT
#define FTM_FLTCTRL_FFLTR0EN_SHIFT           ((uint32)(4U))
#endif

#define FTM_FLTCTRL_FAULT3EN_MASK_U32        ((uint32)(BIT3))
#ifndef FTM_FLTCTRL_FAULT3EN_SHIFT
#define FTM_FLTCTRL_FAULT3EN_SHIFT           ((uint32)(3U))
#endif

#define FTM_FLTCTRL_FAULT2EN_MASK_U32        ((uint32)(BIT2))
#ifndef FTM_FLTCTRL_FAULT2EN_SHIFT
#define FTM_FLTCTRL_FAULT2EN_SHIFT           ((uint32)(2U))
#endif

#define FTM_FLTCTRL_FAULT1EN_MASK_U32        ((uint32)(BIT1))
#ifndef FTM_FLTCTRL_FAULT1EN_SHIFT
#define FTM_FLTCTRL_FAULT1EN_SHIFT           ((uint32)(1U))
#endif

#define FTM_FLTCTRL_FAULT0EN_MASK_U32        ((uint32)(BIT0))

/**
@{
* @brief FTMx_QDCTRL - Quadrature Decoder Control And Status - bitfield mask and shift defines.
*/

#define FTM_QDCTRL_PHAFLTREN_MASK_U32        ((uint32)(BIT7))
#ifndef FTM_QDCTRL_PHAFLTREN_SHIFT
#define FTM_QDCTRL_PHAFLTREN_SHIFT           ((uint32)(7U))
#endif

