marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_QDCTRL_PHBFLTREN_MASK_U32        ((uint32)(BIT6))
#ifndef FTM_QDCTRL_PHBFLTREN_SHIFT
#define FTM_QDCTRL_PHBFLTREN_SHIFT           ((uint32)(6U))
#endif

#define FTM_QDCTRL_PHAPOL_MASK_U32           ((uint32)(BIT5))
#ifndef FTM_QDCTRL_PHAPOL_SHIFT
#define FTM_QDCTRL_PHAPOL_SHIFT              ((uint32)(5U))
#endif

#define FTM_QDCTRL_PHBPOL_MASK_U32           ((uint32)(BIT4))
#ifndef FTM_QDCTRL_PHBPOL_SHIFT
#define FTM_QDCTRL_PHBPOL_SHIFT              ((uint32)(4U))
#endif

#define FTM_QDCTRL_QUADMODE_MASK_U32         ((uint32)(BIT3))
#ifndef FTM_QDCTRL_QUADMODE_SHIFT
#define FTM_QDCTRL_QUADMODE_SHIFT            ((uint32)(3U))
#endif

#define FTM_QDCTRL_QUADIR_MASK_U32           ((uint32)(BIT2))
#ifndef FTM_QDCTRL_QUADIR_SHIFT
#define FTM_QDCTRL_QUADIR_SHIFT              ((uint32)(2U))
#endif

#define FTM_QDCTRL_TOFDIR_MASK_U32           ((uint32)(BIT1))
#ifndef FTM_QDCTRL_TOFDIR_SHIFT
#define FTM_QDCTRL_TOFDIR_SHIFT              ((uint32)(1U))
#endif

#define FTM_QDCTRL_QUADEN_MASK_U32           ((uint32)(BIT0))

/**
@{
* @brief FTMx_CONF - Configuration - bitfield mask and shift defines.
*/

#define FTM_CONF_GTBEOUT_MASK_U32           ((uint32)(BIT10))
#ifndef FTM_CONF_GTBEOUT_SHIFT
#define FTM_CONF_GTBEOUT_SHIFT              ((uint32)(10U))
#endif

#define FTM_CONF_GTBEEN_MASK_U32            ((uint32)(BIT9))
#ifndef FTM_CONF_GTBEEN_SHIFT
#define FTM_CONF_GTBEEN_SHIFT               ((uint32)(9U))
#endif

#define FTM_CONF_BDMMODE_MASK_U32           ((uint32)(BIT7|BIT6))
#ifndef FTM_CONF_BDMMODE_SHIFT
#define FTM_CONF_BDMMODE_SHIFT              ((uint32)(6U))
#endif

#define FTM_CONF_NUMTOF_MASK_U32            ((uint32)(BIT4|BIT3|BIT2|BIT1|BIT0))


/**
@{
* @brief FTMx_FLTPOL - Fault Input Polarity - bitfield mask and shift defines.
*/

#define FTM_FLTPOL_FLT3POL_MASK_U32         ((uint32)(BIT3))
#ifndef FTM_FLTPOL_FLT3POL_SHIFT
#define FTM_FLTPOL_FLT3POL_SHIFT            ((uint32)(3U))
#endif

#define FTM_FLTPOL_FLT2POL_MASK_U32         ((uint32)(BIT2))
#ifndef FTM_FLTPOL_FLT2POL_SHIFT
#define FTM_FLTPOL_FLT2POL_SHIFT            ((uint32)(2U))
#endif

#define FTM_FLTPOL_FLT1POL_MASK_U32         ((uint32)(BIT1))
#ifndef FTM_FLTPOL_FLT1POL_SHIFT
#define FTM_FLTPOL_FLT1POL_SHIFT            ((uint32)(1U))
#endif

#define FTM_FLTPOL_FLT0POL_MASK_U32         ((uint32)(BIT0))


/**
@{
* @brief FTMx_SYNCONF - Synchronization Configuration - bitfield mask and shift defines.
*/

#define FTM_SYNCONF_HWSOC_MASK_U32          ((uint32)(BIT20))
#ifndef FTM_SYNCONF_HWSOC_SHIFT
#define FTM_SYNCONF_HWSOC_SHIFT             ((uint32)(20U))
#endif

#define FTM_SYNCONF_HWINVC_MASK_U32         ((uint32)(BIT19))
#ifndef FTM_SYNCONF_HWINVC_SHIFT
#define FTM_SYNCONF_HWINVC_SHIFT            ((uint32)(19U))
#endif

#define FTM_SYNCONF_HWOM_MASK_U32           ((uint32)(BIT18))
#ifndef FTM_SYNCONF_HWOM_SHIFT
#define FTM_SYNCONF_HWOM_SHIFT              ((uint32)(18U))
#endif

#define FTM_SYNCONF_HWWRBUF_MASK_U32        ((uint32)(BIT17))
#ifndef FTM_SYNCONF_HWWRBUF_SHIFT
#define FTM_SYNCONF_HWWRBUF_SHIFT           ((uint32)(17U))
#endif

#define FTM_SYNCONF_HWRSTCNT_MASK_U32       ((uint32)(BIT16))
#ifndef FTM_SYNCONF_HWRSTCNT_SHIFT
#define FTM_SYNCONF_HWRSTCNT_SHIFT          ((uint32)(16U))
#endif

#define FTM_SYNCONF_SWSOC_MASK_U32          ((uint32)(BIT12))
#ifndef FTM_SYNCONF_SWSOC_SHIFT
#define FTM_SYNCONF_SWSOC_SHIFT             ((uint32)(12U))
#endif

#define FTM_SYNCONF_SWINVC_MASK_U32         ((uint32)(BIT11))
#ifndef FTM_SYNCONF_SWINVC_SHIFT
#define FTM_SYNCONF_SWINVC_SHIFT            ((uint32)(11U))
#endif

#define FTM_SYNCONF_SWOM_MASK_U32           ((uint32)(BIT10))
#ifndef FTM_SYNCONF_SWOM_SHIFT
#define FTM_SYNCONF_SWOM_SHIFT              ((uint32)(10U))
#endif

#define FTM_SYNCONF_SWWRBUF_MASK_U32        ((uint32)(BIT9))
#ifndef FTM_SYNCONF_SWWRBUF_SHIFT
#define FTM_SYNCONF_SWWRBUF_SHIFT           ((uint32)(9U))
#endif

#define FTM_SYNCONF_SWRSTCNT_MASK_U32       ((uint32)(BIT8))
#ifndef FTM_SYNCONF_SWRSTCNT_SHIFT
#define FTM_SYNCONF_SWRSTCNT_SHIFT          ((uint32)(8U))
#endif

#define FTM_SYNCONF_SYNCMODE_MASK_U32       ((uint32)(BIT7))
#ifndef FTM_SYNCONF_SYNCMODE_SHIFT
#define FTM_SYNCONF_SYNCMODE_SHIFT          ((uint32)(7U))
#endif

#define FTM_SYNCONF_SWOC_MASK_U32           ((uint32)(BIT5))
#ifndef FTM_SYNCONF_SWOC_SHIFT
#define FTM_SYNCONF_SWOC_SHIFT              ((uint32)(5U))
#endif

#define FTM_SYNCONF_INVC_MASK_U32           ((uint32)(BIT4))
#ifndef FTM_SYNCONF_INVC_SHIFT
#define FTM_SYNCONF_INVC_SHIFT              ((uint32)(4U))
#endif

#define FTM_SYNCONF_CNTINC_MASK_U32         ((uint32)(BIT2))
#ifndef FTM_SYNCONF_CNTINC_SHIFT
#define FTM_SYNCONF_CNTINC_SHIFT            ((uint32)(2U))
#endif

#define FTM_SYNCONF_HWTRIGMODE_MASK_U32     ((uint32)(BIT0))


/**
@{
* @brief FTMx_INVCTRL - Inverting Control - bitfield mask and shift defines.
*/

#define FTM_INVCTRL_INV3EN_MASK_U32     ((uint32)(BIT3))
#ifndef FTM_INVCTRL_INV3EN_SHIFT
#define FTM_INVCTRL_INV3EN_SHIFT        ((uint32)(3U))
#endif

#define FTM_INVCTRL_INV2EN_MASK_U32     ((uint32)(BIT2))
#ifndef FTM_INVCTRL_INV2EN_SHIFT
#define FTM_INVCTRL_INV2EN_SHIFT        ((uint32)(2U))
#endif

#define FTM_INVCTRL_INV1EN_MASK_U32     ((uint32)(BIT1))
#ifndef FTM_INVCTRL_INV1EN_SHIFT
#define FTM_INVCTRL_INV1EN_SHIFT        ((uint32)(1U))
#endif

#define FTM_INVCTRL_INV0EN_MASK_U32     ((uint32)(BIT0))

/**
@{
* @brief FTMx_SWOCTRL - Software Output Control - bitfield mask and shift defines.
*/

#define FTM_SWOCTRL_CH7OCV_MASK_U32     ((uint32)(BIT15))
#ifndef FTM_SWOCTRL_CH7OCV_SHIFT
#define FTM_SWOCTRL_CH7OCV_SHIFT        ((uint32)(15U))
#endif

#define FTM_SWOCTRL_CH6OCV_MASK_U32     ((uint32)(BIT14))
#ifndef FTM_SWOCTRL_CH6OCV_SHIFT
#define FTM_SWOCTRL_CH6OCV_SHIFT        ((uint32)(14U))
#endif

#define FTM_SWOCTRL_CH5OCV_MASK_U32     ((uint32)(BIT13))
#ifndef FTM_SWOCTRL_CH5OCV_SHIFT
#define FTM_SWOCTRL_CH5OCV_SHIFT        ((uint32)(13U))
#endif

#define FTM_SWOCTRL_CH4OCV_MASK_U32     ((uint32)(BIT12))
#ifndef FTM_SWOCTRL_CH4OCV_SHIFT
#define FTM_SWOCTRL_CH4OCV_SHIFT        ((uint32)(12U))
#endif

