marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_SWOCTRL_CH3OCV_MASK_U32     ((uint32)(BIT11))
#ifndef FTM_SWOCTRL_CH3OCV_SHIFT
#define FTM_SWOCTRL_CH3OCV_SHIFT        ((uint32)(11U))
#endif

#define FTM_SWOCTRL_CH2OCV_MASK_U32     ((uint32)(BIT10))
#ifndef FTM_SWOCTRL_CH2OCV_SHIFT
#define FTM_SWOCTRL_CH2OCV_SHIFT        ((uint32)(10U))
#endif

#define FTM_SWOCTRL_CH1OCV_MASK_U32     ((uint32)(BIT9))
#ifndef FTM_SWOCTRL_CH1OCV_SHIFT
#define FTM_SWOCTRL_CH1OCV_SHIFT        ((uint32)(9U))
#endif

#define FTM_SWOCTRL_CH0OCV_MASK_U32     ((uint32)(BIT8))
#ifndef FTM_SWOCTRL_CH0OCV_SHIFT
#define FTM_SWOCTRL_CH0OCV_SHIFT        ((uint32)(8U))
#endif

#define FTM_SWOCTRL_CH7OC_MASK_U32     ((uint32)(BIT7))
#ifndef FTM_SWOCTRL_CH7OC_SHIFT
#define FTM_SWOCTRL_CH7OC_SHIFT        ((uint32)(7U))
#endif

#define FTM_SWOCTRL_CH6OC_MASK_U32     ((uint32)(BIT6))
#ifndef FTM_SWOCTRL_CH6OC_SHIFT
#define FTM_SWOCTRL_CH6OC_SHIFT        ((uint32)(6U))
#endif

#define FTM_SWOCTRL_CH5OC_MASK_U32     ((uint32)(BIT5))
#ifndef FTM_SWOCTRL_CH5OC_SHIFT
#define FTM_SWOCTRL_CH5OC_SHIFT        ((uint32)(5U))
#endif

#define FTM_SWOCTRL_CH4OC_MASK_U32     ((uint32)(BIT4))
#ifndef FTM_SWOCTRL_CH4OC_SHIFT
#define FTM_SWOCTRL_CH4OC_SHIFT        ((uint32)(4U))
#endif

#define FTM_SWOCTRL_CH3OC_MASK_U32     ((uint32)(BIT3))
#ifndef FTM_SWOCTRL_CH3OC_SHIFT
#define FTM_SWOCTRL_CH3OC_SHIFT        ((uint32)(3U))
#endif

#define FTM_SWOCTRL_CH2OC_MASK_U32     ((uint32)(BIT2))
#ifndef FTM_SWOCTRL_CH2OC_SHIFT
#define FTM_SWOCTRL_CH2OC_SHIFT        ((uint32)(2U))
#endif

#define FTM_SWOCTRL_CH1OC_MASK_U32     ((uint32)(BIT1))
#ifndef FTM_SWOCTRL_CH1OC_SHIFT
#define FTM_SWOCTRL_CH1OC_SHIFT        ((uint32)(1U))
#endif

#define FTM_SWOCTRL_CH0OC_MASK_U32     ((uint32)(BIT0))

/**
@{
* @brief FTMx_PWMLOAD - PWM Load - bitfield mask and shift defines.
*/

#define FTM_PWMLOAD_LDOK_MASK_U32       ((uint32)(BIT9))
#ifndef FTM_PWMLOAD_LDOK_SHIFT
#define FTM_PWMLOAD_LDOK_SHIFT          ((uint32)(9U))
#endif

#define FTM_PWMLOAD_CH7SEL_MASK_U32     ((uint32)(BIT7))
#ifndef FTM_PWMLOAD_CH7SEL_SHIFT
#define FTM_PWMLOAD_CH7SEL_SHIFT        ((uint32)(7U))
#endif

#define FTM_PWMLOAD_CH6SEL_MASK_U32     ((uint32)(BIT6))
#ifndef FTM_PWMLOAD_CH6SEL_SHIFT
#define FTM_PWMLOAD_CH6SEL_SHIFT        ((uint32)(6U))
#endif

#define FTM_PWMLOAD_CH5SEL_MASK_U32     ((uint32)(BIT5))
#ifndef FTM_PWMLOAD_CH5SEL_SHIFT
#define FTM_PWMLOAD_CH5SEL_SHIFT        ((uint32)(5U))
#endif

#define FTM_PWMLOAD_CH4SEL_MASK_U32     ((uint32)(BIT4))
#ifndef FTM_PWMLOAD_CH4SEL_SHIFT
#define FTM_PWMLOAD_CH4SEL_SHIFT        ((uint32)(4U))
#endif

#define FTM_PWMLOAD_CH3SEL_MASK_U32     ((uint32)(BIT3))
#ifndef FTM_PWMLOAD_CH3SEL_SHIFT
#define FTM_PWMLOAD_CH3SEL_SHIFT        ((uint32)(3U))
#endif

#define FTM_PWMLOAD_CH2SEL_MASK_U32     ((uint32)(BIT2))
#ifndef FTM_PWMLOAD_CH2SEL_SHIFT
#define FTM_PWMLOAD_CH2SEL_SHIFT        ((uint32)(2U))
#endif

#define FTM_PWMLOAD_CH1SEL_MASK_U32     ((uint32)(BIT1))
#ifndef FTM_PWMLOAD_CH1SEL_SHIFT
#define FTM_PWMLOAD_CH1SEL_SHIFT        ((uint32)(1U))
#endif

#define FTM_PWMLOAD_CH0SEL_MASK_U32     ((uint32)(BIT0))


/** Bitfield defines. */
/**
* @{
* @brief FTMx_CnSC - bitfield defines.
*/

#define FTM_CSC_CHF_NO_EVENT_U32         ((uint32)(0U))
#define FTM_CSC_CHF_EVENT_OCCURED_U32    ((uint32)(1U) << FTM_CSC_CHF_SHIFT)
#define FTM_CSC_CHIE_DISABLE_U32         ((uint32)(0U))
#define FTM_CSC_CHIE_ENABLE_U32          ((uint32)(1U) << FTM_CSC_CHIE_SHIFT )

#define FTM_CSC_MSX_PWMFORM_U32          ((uint32)(1U) << FTM_CSC_MSB_SHIFT )

#define FTM_CSC_ELSX_PWMFORM_U32         ((uint32)(1U) << FTM_CSC_ELSB_SHIFT )


#define FTM_CSC_DMA_DISABLE_U32          ((uint32)(0U))
#define FTM_CSC_DMA_ENABLE_U32           ((uint32)(1U))

/**
* @{
* @brief FTMx_SC - bitfield defines.
*/

#define FTM_SC_TOF_NO_OVF_U32                ((uint32)(0U)) 
#define FTM_SC_TOF_OVF_U32                   ((uint32)(1U) << FTM_SC_TOF_SHIFT)
#define FTM_SC_TOIE_DISABLE_U32              ((uint32)(0U))
#define FTM_SC_TOIE_ENABLE_U32               ((uint32)(1U) << FTM_SC_TOIE_SHIFT)
#define FTM_SC_CPWMS_UP_COUNTING_U32         ((uint32)(0U) << FTM_SC_CPWMS_SHIFT)
#define FTM_SC_CPWMS_UP_DOWN_COUNTING_U32    ((uint32)(1U) << FTM_SC_CPWMS_SHIFT)
#define FTM_SC_CLKS_NO_CLOCKS_U32            ((uint32)(0U) << FTM_SC_CLKS_SHIFT)
#define FTM_SC_CLKS_SYS_CLOCK_U32            ((uint32)(1U) << FTM_SC_CLKS_SHIFT)
#define FTM_SC_CLKS_FIXED_FREQ_CLOCK_U32     ((uint32)(2U) << FTM_SC_CLKS_SHIFT)
#define FTM_SC_CLKS_EXTERNAL_CLOCK_U32       ((uint32)(3U) << FTM_SC_CLKS_SHIFT)
#define FTM_SC_PS_DIV1_U32                   ((uint32)(0U))
#define FTM_SC_PS_DIV2_U32                   ((uint32)(1U))
#define FTM_SC_PS_DIV4_U32                   ((uint32)(2U))
#define FTM_SC_PS_DIV8_U32                   ((uint32)(3U))
#define FTM_SC_PS_DIV16_U32                  ((uint32)(4U))
#define FTM_SC_PS_DIV32_U32                  ((uint32)(5U))
#define FTM_SC_PS_DIV64_U32                  ((uint32)(6U))
#define FTM_SC_PS_DIV128_U32                 ((uint32)(7U))
#define FTM_SC_PWMOUTPUTEN_SHIFT             ((uint32)(16U))



/**
* @{
* @brief FTMx_MODE - bitfield defines.
*/

#define FTM_MODE_FAULTIE_DISABLE_U32        ((uint32)(0U))
#define FTM_MODE_FAULTIE_ENABLE_U32         ((uint32)(1U) << FTM_MODE_FAULTIE_SHIFT)
#define FTM_MODE_FAULTM_DISABLED_U32        ((uint32)(0U))
#define FTM_MODE_FAULTM_ENABLE_EVEN_U32     ((uint32)(1U) << FTM_MODE_FAULTM_SHIFT)
#define FTM_MODE_FAULTM_ENABLED_MANUAL_U32  ((uint32)(2U) << FTM_MODE_FAULTM_SHIFT)
#define FTM_MODE_FAULTM_ENABLED_AUTO_U32    ((uint32)(3U) << FTM_MODE_FAULTM_SHIFT)
#define FTM_MODE_CAPTEST_DISABLE_U32        ((uint32)(0U))
#define FTM_MODE_CAPTEST_ENABLE_U32         ((uint32)(1U) << FTM_MODE_CAPTEST_SHIFT)

#define FTM_MODE_PWMSYNC_ENABLE_U32         ((uint32)(1U) << FTM_MODE_PWMSYNC_SHIFT)
#define FTM_MODE_PWMSYNC_DISABLE_U32        ((uint32)(0U))

#define FTM_MODE_WPDIS_ENABLE_U32           ((uint32)(0U)) 
#define FTM_MODE_WPDIS_DISABLE_U32          ((uint32)(1U) << FTM_MODE_WPDIS_SHIFT)

#define FTM_MODE_INIT_ENABLE_U32            ((uint32)(1U) << FTM_MODE_INIT_SHIFT) 
#define FTM_MODE_INIT_DISABLE_U32           ((uint32)(0U))

#define FTM_MODE_FTMEN_ENABLE_U32           ((uint32)(1U)) 
#define FTM_MODE_FTMEN_DISABLE_U32          ((uint32)(0U))


/**
* @{
* @brief FTMx_SYNC - bitfield defines.
*/
#define FTM_SYNC_SWSYNC_SELECTED_U32        ((uint32)(1U))
#define FTM_SYNC_SWSYNC_NOT_SELECTED_U32    ((uint32)(0U))
#define FTM_SYNC_TRIG2_DISABLE_U32          ((uint32)(0U))
#define FTM_SYNC_TRIG2_ENABLE_U32           ((uint32)(1U))
#define FTM_SYNC_TRIG1_DISABLE_U32          ((uint32)(0U))
#define FTM_SYNC_TRIG1_ENABLE_U32           ((uint32)(1U))
#define FTM_SYNC_TRIG0_DISABLE_U32          ((uint32)(0U))
#define FTM_SYNC_TRIG0_ENABLE_U32           ((uint32)(1U))
#define FTM_SYNC_SYNCHOM_RISING_EDGE_U32    ((uint32)(0U))
#define FTM_SYNC_SYNCHOM_SYNC_U32           ((uint32)(1U))

#define FTM_SYNC_REINIT_DISABLE_U32         ((uint32)(0U))
#define FTM_SYNC_REINIT_ENABLE_U32          ((uint32)(1U))

