marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_SYNC_CNTMAX_DISABLE_U32         ((uint32)(0U))
#define FTM_SYNC_CNTMAX_ENABLE_U32          ((uint32)(1U))
#define FTM_SYNC_CNTMIN_DISABLE_U32         ((uint32)(0U))
#define FTM_SYNC_CNTMIN_ENABLE_U32          ((uint32)(1U))


/**
* @{
* @brief FTMx_COMBINE - bitfield defines.
*/
#define FTM_COMBINE_MCOMBINE3_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_MCOMBINE3_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_MCOMBINE3_SHIFT)
#define FTM_COMBINE_FAULTEN3_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_FAULTEN3_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_FAULTEN3_SHIFT)
#define FTM_COMBINE_SYNCEN3_DISABLE_U32      ((uint32)(0U))
#define FTM_COMBINE_SYNCEN3_ENABLE_U32       ((uint32)(1U) << FTM_COMBINE_SYNCEN3_SHIFT)
#define FTM_COMBINE_DTEN3_DISABLE_U32        ((uint32)(0U)) 
#define FTM_COMBINE_DTEN3_ENABLE_U32         ((uint32)(1U) << FTM_COMBINE_DTEN3_SHIFT)
#define FTM_COMBINE_DECAP3_INACTIVE_U32      ((uint32)(0U))
#define FTM_COMBINE_DECAP3_ACTIVE_U32        ((uint32)(1U) << FTM_COMBINE_DECAP3_SHIFT)
#define FTM_COMBINE_COMP3_SAME_U32           ((uint32)(0U))
#define FTM_COMBINE_COMP3_COMPLEMENT_U32     ((uint32)(1U) << FTM_COMBINE_COMP3_SHIFT)
#define FTM_COMBINE_COMBINE3_INDEPENDENT_U32 ((uint32)(0U))
#define FTM_COMBINE_COMBINE3_COMBINED_U32    ((uint32)(1U)  << FTM_COMBINE_COMBINE3_SHIFT)

#define FTM_COMBINE_MCOMBINE2_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_MCOMBINE2_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_MCOMBINE2_SHIFT)
#define FTM_COMBINE_FAULTEN2_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_FAULTEN2_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_FAULTEN2_SHIFT)
#define FTM_COMBINE_SYNCEN2_DISABLE_U32      ((uint32)(0U))
#define FTM_COMBINE_SYNCEN2_ENABLE_U32       ((uint32)(1U) << FTM_COMBINE_SYNCEN2_SHIFT)
#define FTM_COMBINE_DTEN2_DISABLE_U32        ((uint32)(0U))
#define FTM_COMBINE_DTEN2_ENABLE_U32         ((uint32)(1U) << FTM_COMBINE_DTEN2_SHIFT)
#define FTM_COMBINE_DECAP2_INACTIVE_U32      ((uint32)(0U))
#define FTM_COMBINE_DECAP2_ACTIVE_U32        ((uint32)(1U) << FTM_COMBINE_DECAP2_SHIFT)
#define FTM_COMBINE_COMP2_SAME_U32           ((uint32)(0U))
#define FTM_COMBINE_COMP2_COMPLEMENT_U32     ((uint32)(1U)  << FTM_COMBINE_COMP2_SHIFT)
#define FTM_COMBINE_COMBINE2_INDEPENDENT_U32 ((uint32)(0U))
#define FTM_COMBINE_COMBINE2_COMBINED_U32    ((uint32)(1U) << FTM_COMBINE_COMBINE2_SHIFT)

#define FTM_COMBINE_MCOMBINE1_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_MCOMBINE1_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_MCOMBINE1_SHIFT)
#define FTM_COMBINE_FAULTEN1_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_FAULTEN1_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_FAULTEN1_SHIFT)
#define FTM_COMBINE_SYNCEN1_DISABLE_U32      ((uint32)(0U))
#define FTM_COMBINE_SYNCEN1_ENABLE_U32       ((uint32)(1U) << FTM_COMBINE_SYNCEN1_SHIFT)
#define FTM_COMBINE_DTEN1_DISABLE_U32        ((uint32)(0U))
#define FTM_COMBINE_DTEN1_ENABLE_U32         ((uint32)(1U) << FTM_COMBINE_DTEN1_SHIFT)
#define FTM_COMBINE_DECAP1_INACTIVE_U32      ((uint32)(0U))
#define FTM_COMBINE_DECAP1_ACTIVE_U32        ((uint32)(1U) << FTM_COMBINE_DECAP1_SHIFT)
#define FTM_COMBINE_COMP1_SAME_U32           ((uint32)(0U))
#define FTM_COMBINE_COMP1_COMPLEMENT_U32     (((uint32)(1U)) << FTM_COMBINE_COMP1_SHIFT)
#define FTM_COMBINE_COMBINE1_INDEPENDENT_U32 ((uint32)(0U))
#define FTM_COMBINE_COMBINE1_COMBINED_U32    ((uint32)(1U) << FTM_COMBINE_COMBINE1_SHIFT)

#define FTM_COMBINE_MCOMBINE0_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_MCOMBINE0_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_MCOMBINE0_SHIFT)
#define FTM_COMBINE_FAULTEN0_DISABLE_U32     ((uint32)(0U))
#define FTM_COMBINE_FAULTEN0_ENABLE_U32      ((uint32)(1U) << FTM_COMBINE_FAULTEN0_SHIFT)
#define FTM_COMBINE_SYNCEN0_DISABLE_U32      ((uint32)(0U))
#define FTM_COMBINE_SYNCEN0_ENABLE_U32       ((uint32)(1U) << FTM_COMBINE_SYNCEN0_SHIFT)
#define FTM_COMBINE_DTEN0_DISABLE_U32        ((uint32)(0U))
#define FTM_COMBINE_DTEN0_ENABLE_U32         ((uint32)(1U) << FTM_COMBINE_DTEN0_SHIFT)
#define FTM_COMBINE_DECAP0_INACTIVE_U32      ((uint32)(0U))
#define FTM_COMBINE_DECAP0_ACTIVE_U32        ((uint32)(1U) << FTM_COMBINE_DECAP0_SHIFT)
#define FTM_COMBINE_COMP0_SAME_U32           ((uint32)(0U))
#define FTM_COMBINE_COMP0_COMPLEMENT_U32     ((uint32)(1U) << FTM_COMBINE_COMP0_SHIFT)
#define FTM_COMBINE_COMBINE0_INDEPENDENT_U32 ((uint32)(0U))
#define FTM_COMBINE_COMBINE0_COMBINED_U32    ((uint32)(1U))


/**
* @{
* @brief FTMx_DEADTIME - bitfield defines.
*/

#define FTM_DEADTIME_DTPS_DIV1_U32          ((uint32)(0U)) 
#define FTM_DEADTIME_DTPS_DIV4_U32          (((uint32)(2U)) << FTM_DEADTIME_DTPS_SHIFT)
#define FTM_DEADTIME_DTPS_DIV16_U32         (((uint32)(3U)) << FTM_DEADTIME_DTPS_SHIFT)



/**
* @{
* @brief FTMx_EXTTRIG - bitfield defines.
*/
#define FTM_EXTTRIG_TRIGF_TRIGGER_U32       ((uint32)(1U))
#define FTM_EXTTRIG_TRIGF_NO_TRIGGER_U32    ((uint32)(0U))
#define FTM_EXTTRIG_INITTRIGEN_ENABLE_U32   ((uint32)(1U))
#define FTM_EXTTRIG_INITTRIGEN_DISABLE_U32  ((uint32)(0U))
#define FTM_EXTTRIG_CH1TRIG_DISABLE_U32     ((uint32)(0U))
#define FTM_EXTTRIG_CH1TRIG_ENABLE_U32      ((uint32)(1U))
#define FTM_EXTTRIG_CH0TRIG_DISABLE_U32     ((uint32)(0U))
#define FTM_EXTTRIG_CH0TRIG_ENABLE_U32      ((uint32)(1U))
#define FTM_EXTTRIG_CH5TRIG_DISABLE_U32     ((uint32)(0U))
#define FTM_EXTTRIG_CH5TRIG_ENABLE_U32      ((uint32)(1U))
#define FTM_EXTTRIG_CH4TRIG_DISABLE_U32     ((uint32)(0U))
#define FTM_EXTTRIG_CH4TRIG_ENABLE_U32      ((uint32)(1U))
#define FTM_EXTTRIG_CH3TRIG_DISABLE_U32     ((uint32)(0U))
#define FTM_EXTTRIG_CH3TRIG_ENABLE_U32      ((uint32)(1U))
#define FTM_EXTTRIG_CH2TRIG_DISABLE_U32     ((uint32)(0U))
#define FTM_EXTTRIG_CH2TRIG_ENABLE_U32      ((uint32)(1U))

/**
* @{
* @brief FTMx_POL - bitfield defines.
*/
#define FTM_POL_POL7_LOW_U32            ((uint32)(1U) << FTM_POL_POL7_SHIFT)
#define FTM_POL_POL7_HIGH_U32           ((uint32)(0U))
#define FTM_POL_POL6_LOW_U32            ((uint32)(1U) << FTM_POL_POL6_SHIFT)
#define FTM_POL_POL6_HIGH_U32           ((uint32)(0U))
#define FTM_POL_POL5_LOW_U32            ((uint32)(1U) << FTM_POL_POL5_SHIFT)
#define FTM_POL_POL5_HIGH_U32           ((uint32)(0U))
#define FTM_POL_POL4_LOW_U32            ((uint32)(1U) << FTM_POL_POL4_SHIFT)
#define FTM_POL_POL4_HIGH_U32           ((uint32)(0U))
#define FTM_POL_POL3_LOW_U32            ((uint32)(1U) << FTM_POL_POL3_SHIFT)
#define FTM_POL_POL3_HIGH_U32           ((uint32)(0U))
#define FTM_POL_POL2_LOW_U32            ((uint32)(1U) << FTM_POL_POL2_SHIFT)
#define FTM_POL_POL2_HIGH_U32           ((uint32)(0U))
#define FTM_POL_POL1_LOW_U32            ((uint32)(1U) << FTM_POL_POL1_SHIFT)
#define FTM_POL_POL1_HIGH_U32           ((uint32)(0U))
#define FTM_POL_POL0_LOW_U32            ((uint32)(1U))
#define FTM_POL_POL0_HIGH_U32           ((uint32)(0U))

/**
* @{
* @brief FTMx_FMS - bitfield defines.
*/
#define FTM_FMS_FAULTF_FAULT_U32            ((uint32)(1U) << FTM_FMS_FAULTF_SHIFT)
#define FTM_FMS_FAULTF_NO_FAULT_U32         ((uint32)(0U))
#define FTM_FMS_WPEN_ENABLE_U32             (((uint32)(1U)) << FTM_FMS_WPEN_SHIFT)
#define FTM_FMS_WPEN_DISABLE_U32            ((uint32)(0U))
#define FTM_FMS_FAULTIN_LOGIC_OR_IS_0_U32   ((uint32)(0U)) /*TO DO: check again*/
#define FTM_FMS_FAULTIN_LOGIC_OR_IS_1_U32   ((uint32)(1U) << FTM_FMS_FAULTIN_SHIFT)
#define FTM_FMS_FAULTF3_FAULT_U32           ((uint32)(1U) << FTM_FMS_FAULTF3_SHIFT)
#define FTM_FMS_FAULTF3_NO_FAULT_U32        ((uint32)(0U))  
#define FTM_FMS_FAULTF2_FAULT_U32           ((uint32)(1U) << FTM_FMS_FAULTF2_SHIFT)
#define FTM_FMS_FAULTF2_NO_FAULT_U32        ((uint32)(0U))  
#define FTM_FMS_FAULTF1_FAULT_U32           ((uint32)(1U) << FTM_FMS_FAULTF1_SHIFT)
#define FTM_FMS_FAULTF1_NO_FAULT_U32        ((uint32)(0U))  
#define FTM_FMS_FAULTF0_FAULT_U32           ((uint32)(1U))
#define FTM_FMS_FAULTF0_NO_FAULT_U32        ((uint32)(0U))  

/**
* @{
* @brief FTMx_FLTCTRL - bitfield defines.
*/
#define FTM_FLTCTRL_FLTSTATE_SAFEVALUE_U32  ((uint32)(0U))
#define FTM_FLTCTRL_FFLTR3EN_TRISTATE_U32   ((uint32)(1U) << FTM_FLTCTRL_FSTATE_SHIFT)
#define FTM_FLTCTRL_FFVAL_U32(value)        (((uint32)(value)) << FTM_FLTCTRL_FFVAL_SHIFT)
#define FTM_FLTCTRL_FFLTR3EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FFLTR3EN_ENABLE_U32     ((uint32)(1U) << FTM_FLTCTRL_FFLTR3EN_SHIFT)
#define FTM_FLTCTRL_FFLTR2EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FFLTR2EN_ENABLE_U32     ((uint32)(1U) << FTM_FLTCTRL_FFLTR2EN_SHIFT)
#define FTM_FLTCTRL_FFLTR1EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FFLTR1EN_ENABLE_U32     ((uint32)(1U) << FTM_FLTCTRL_FFLTR1EN_SHIFT)
#define FTM_FLTCTRL_FFLTR0EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FFLTR0EN_ENABLE_U32     ((uint32)(1U) << FTM_FLTCTRL_FFLTR0EN_SHIFT)
#define FTM_FLTCTRL_FAULT3EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FAULT3EN_ENABLE_U32     ((uint32)(1U) << FTM_FLTCTRL_FAULT3EN_SHIFT)
#define FTM_FLTCTRL_FAULT2EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FAULT2EN_ENABLE_U32     ((uint32)(1U) << FTM_FLTCTRL_FAULT2EN_SHIFT)
#define FTM_FLTCTRL_FAULT1EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FAULT1EN_ENABLE_U32     ((uint32)(1U) << FTM_FLTCTRL_FAULT1EN_SHIFT)
#define FTM_FLTCTRL_FAULT0EN_DISABLE_U32    ((uint32)(0U))
#define FTM_FLTCTRL_FAULT0EN_ENABLE_U32     ((uint32)(1U))

/**
* @{
* @brief FTMx_QDCTRL - bitfield defines.
*/

#define FTM_QDCTRL_PHAFLTREN_ENABLE_U32     ((uint32)(1U))
#define FTM_QDCTRL_PHAFLTREN_DISABLE_U32    ((uint32)(0U))
#define FTM_QDCTRL_PHBFLTREN_ENABLE_U32     ((uint32)(1U))
#define FTM_QDCTRL_PHBFLTREN_DISABLE_U32    ((uint32)(0U))
#define FTM_QDCTRL_PHAPOL_NORMAL_U32        ((uint32)(0U))
#define FTM_QDCTRL_PHAPOL_INVERTED_U32      ((uint32)(1U))
#define FTM_QDCTRL_PHBPOL_NORMAL_U32        ((uint32)(0U))
#define FTM_QDCTRL_PHBPOL_INVERTED_U32      ((uint32)(1U))
#define FTM_QDCTRL_PHA_PHB_MODE_U32         ((uint32)(0U))
#define FTM_QDCTRL_COUNT_DIRECTION_MODE_U32 ((uint32)(1U))
#define FTM_QDCTRL_QUADIR_DECREMENT_U32     ((uint32)(0U))
#define FTM_QDCTRL_QUADIR_INCREMENT_U32     ((uint32)(1U))
#define FTM_QDCTRL_TOFDIR_BOTTOM_U32        ((uint32)(0U))
#define FTM_QDCTRL_TOFDIR_TOP_U32           ((uint32)(1U))
#define FTM_QDCTRL_QUADEN_DISABLE_U32       ((uint32)(0U))
#define FTM_QDCTRL_QUADEN_ENABLE_U32        ((uint32)(1U))

/**
* @{
* @brief FTMx_CONF - bitfield defines.
*/

#define FTM_CONF_GTBEOUT_ENABLE_U32         (((uint32)(1U)) << FTM_CONF_GTBEOUT_SHIFT)
#define FTM_CONF_GTBEOUT_DISABLE_U32        ((uint32)(0U))
#define FTM_CONF_GTBEN_ENABLE_U32           (((uint32)(1U)) << FTM_CONF_GTBEN_SHIFT)
#define FTM_CONF_GTBEEN_DISABLE_U32         ((uint32)(0U))
#define FTM_CONF_BDMMODE_ALLSTOP_U32        ((uint32)(0U))
#define FTM_CONF_BDMMODE_OUTPUTSSAFE_U32    ((uint32)(1U) <<  FTM_CONF_BDMMODE_SHIFT)
#define FTM_CONF_BDMMODE_OUTPUTSRUN_U32     ((uint32)(2U) <<  FTM_CONF_BDMMODE_SHIFT)
#define FTM_CONF_BDMMODE_ALLRUN_U32         ((uint32)(3U) <<  FTM_CONF_BDMMODE_SHIFT)

/**
* @{
* @brief FTMx_FLTPOL - bitfield defines.
*/

