marshallma21/AUTOSAR_SampleProject_S32K144/plugins/Mcl_TS_T40D2M10I1R0/include/Reg_eSys_Ftm.h
#define FTM_FLTPOL_FLT3POL_LOW_U32      ((uint32)(0U))
#define FTM_FLTPOL_FLT3POL_HIGH_U32     (((uint32)(1U)) << FTM_FLTPOL_FLT3POL_SHIFT)
#define FTM_FLTPOL_FLT2POL_LOW_U32      ((uint32)(0U))
#define FTM_FLTPOL_FLT2POL_HIGH_U32     (((uint32)(1U)) << FTM_FLTPOL_FLT2POL_SHIFT)
#define FTM_FLTPOL_FLT1POL_LOW_U32      ((uint32)(0U))
#define FTM_FLTPOL_FLT1POL_HIGH_U32     (((uint32)(1U)) << FTM_FLTPOL_FLT1POL_SHIFT)
#define FTM_FLTPOL_FLT0POL_LOW_U32      ((uint32)(0U))
#define FTM_FLTPOL_FLT0POL_HIGH_U32     ((uint32)(1U))


/**
* @{
* @brief FTMx_SYNCONF - bitfield defines.
*/


/**
* @{
* @brief FTMx_INVCTRL - bitfield defines.
*/
#define FTM_INVCTRL_INV3EN_DISABLE_U32      ((uint32)(0U))
#define FTM_INVCTRL_INV3EN_ENABLE_U32       (((uint32)(1U)) << FTM_INVCTRL_INV3EN_SHIFT)
#define FTM_INVCTRL_INV2EN_DISABLE_U32      ((uint32)(0U))
#define FTM_INVCTRL_INV2EN_ENABLE_U32       (((uint32)(1U)) << FTM_INVCTRL_INV2EN_SHIFT)
#define FTM_INVCTRL_INV1EN_DISABLE_U32      ((uint32)(0U))
#define FTM_INVCTRL_INV1EN_ENABLE_U32       (((uint32)(1U)) << FTM_INVCTRL_INV1EN_SHIFT)
#define FTM_INVCTRL_INV0EN_DISABLE_U32      ((uint32)(0U))
#define FTM_INVCTRL_INV0EN_ENABLE_U32       ((uint32)(1U))

/**
* @{
* @brief FTMx_SWOCTRL - bitfield defines.
*/
#define FTM_SWOCTRL_CH7OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH7OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH7OCV_SHIFT)
#define FTM_SWOCTRL_CH6OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH6OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH6OCV_SHIFT)
#define FTM_SWOCTRL_CH5OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH5OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH5OCV_SHIFT)
#define FTM_SWOCTRL_CH4OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH4OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH4OCV_SHIFT)
#define FTM_SWOCTRL_CH3OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH3OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH3OCV_SHIFT)
#define FTM_SWOCTRL_CH2OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH2OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH2OCV_SHIFT)
#define FTM_SWOCTRL_CH1OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH1OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH1OCV_SHIFT)
#define FTM_SWOCTRL_CH0OCV_FORCE_0_U32      ((uint32)(0U))
#define FTM_SWOCTRL_CH0OCV_FORCE_1_U32      ((uint32)(1U) << FTM_SWOCTRL_CH0OCV_SHIFT)

#define FTM_SWOCTRL_CH7OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH7OC_ENABLE_U32        ((uint32)(1U) << FTM_SWOCTRL_CH7OC_SHIFT)
#define FTM_SWOCTRL_CH6OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH6OC_ENABLE_U32        ((uint32)(1U) << FTM_SWOCTRL_CH6OC_SHIFT)
#define FTM_SWOCTRL_CH5OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH5OC_ENABLE_U32        ((uint32)(1U) << FTM_SWOCTRL_CH5OC_SHIFT)
#define FTM_SWOCTRL_CH4OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH4OC_ENABLE_U32        ((uint32)(1U) << FTM_SWOCTRL_CH4OC_SHIFT)
#define FTM_SWOCTRL_CH3OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH3OC_ENABLE_U32        ((uint32)(1U) << FTM_SWOCTRL_CH3OC_SHIFT)
#define FTM_SWOCTRL_CH2OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH2OC_ENABLE_U32        ((uint32)(1U) << FTM_SWOCTRL_CH2OC_SHIFT)
#define FTM_SWOCTRL_CH1OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH1OC_ENABLE_U32        ((uint32)(1U) << FTM_SWOCTRL_CH1OC_SHIFT)
#define FTM_SWOCTRL_CH0OC_DISABLE_U32       ((uint32)(0U))
#define FTM_SWOCTRL_CH0OC_ENABLE_U32        ((uint32)(1U))
/**
* @{
* @brief FTMx_PWMLOAD - bitfield defines.
*/
#define FTM_PWMLOAD_LDOK_DISABLE_U32       ((uint32)(0U))
#define FTM_PWMLOAD_LDOK_ENABLE_U32        (((uint32)(1U)) << FTM_PWMLOAD_LDOK_SHIFT)
#define FTM_PWMLOAD_CH7SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH7SEL_ENABLE_U32      (((uint32)(1U)) << FTM_PWMLOAD_CH7SEL_SHIFT)
#define FTM_PWMLOAD_CH6SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH6SEL_ENABLE_U32      (((uint32)(1U)) << FTM_PWMLOAD_CH6SEL_SHIFT)
#define FTM_PWMLOAD_CH5SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH5SEL_ENABLE_U32      (((uint32)(1U)) << FTM_PWMLOAD_CH5SEL_SHIFT)
#define FTM_PWMLOAD_CH4SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH4SEL_ENABLE_U32      (((uint32)(1U)) << FTM_PWMLOAD_CH4SEL_SHIFT)
#define FTM_PWMLOAD_CH3SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH3SEL_ENABLE_U32      (((uint32)(1U)) << FTM_PWMLOAD_CH3SEL_SHIFT)
#define FTM_PWMLOAD_CH2SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH2SEL_ENABLE_U32      (((uint32)(1U)) << FTM_PWMLOAD_CH2SEL_SHIFT)
#define FTM_PWMLOAD_CH1SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH1SEL_ENABLE_U32      (((uint32)(1U)) << FTM_PWMLOAD_CH1SEL_SHIFT)
#define FTM_PWMLOAD_CH0SEL_DISABLE_U32     ((uint32)(0U))
#define FTM_PWMLOAD_CH0SEL_ENABLE_U32      ((uint32)(1U))


/*==================================================================================================
*                                            ENUMS
==================================================================================================*/

/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/



/*===============================================================================================
*                                             ENUMS
===============================================================================================*/

/*===============================================================================================
*                            STRUCTURES AND OTHER TYPEDEFS
===============================================================================================*/

/*===============================================================================================
*                                 GLOBAL VARIABLE DECLARATIONS
===============================================================================================*/

/*===============================================================================================
                                     FUNCTION PROTOTYPES
===============================================================================================*/

#ifdef __cplusplus
}
#endif



#endif /* REG_ESYS_FTM_H */

/** @} */
